
# YOLO11-P2-SimAM for InsPLAD
nc: 17 
scales:
  n: [0.50, 0.25, 1024] 

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]    # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]   # 1-P2/4
  - [-1, 3, C3k2, [128, False, 0.25]] # 2
  - [-1, 1, SimAM, []]           # 3 (新增：在Backbone P2层注入注意力，过滤背景噪声)
  - [-1, 1, Conv, [256, 3, 2]]   # 4-P3/8
  - [-1, 6, C3k2, [256, False, 0.25]] # 5
  - [-1, 1, Conv, [512, 3, 2]]   # 6-P4/16
  - [-1, 6, C3k2, [512, True, 0.5]] # 7
  - [-1, 1, Conv, [1024, 3, 2]]  # 8-P5/32
  - [-1, 3, C3k2, [1024, True, 0.5]] # 9
  - [-1, 1, SPPF, [1024, 5]]    # 10
  - [-1, 2, C2PSA, [1024]]      # 11

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 12
  - [[-1, 7], 1, Concat, [1]]   # cat backbone P4
  - [-1, 3, C3k2, [512, False]] # 14

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 15
  - [[-1, 5], 1, Concat, [1]]   # cat backbone P3
  - [-1, 3, C3k2, [256, False]] # 17 (P3/8-level)

  # --- 增强型 P2 层开始 ---
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 18
  - [[-1, 3], 1, Concat, [1]]   # cat backbone P2 (这里连的是带SimAM的第3层)
  - [-1, 1, SimAM, []]          # 20 (再次强化融合后的特征)
  - [-1, 3, C3k2, [128, False]] # 21 (P2/4-level 极小目标检测层)
  # --- 增强型 P2 层结束 ---

  - [-1, 1, Conv, [128, 3, 2]]  # 22
  - [[-1, 17], 1, Concat, [1]]  # cat head P3
  - [-1, 3, C3k2, [256, False]] # 24 (P3/8-level)

  - [-1, 1, Conv, [256, 3, 2]]  # 25
  - [[-1, 14], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C3k2, [512, False]] # 27 (P4/16-level)

  - [-1, 1, Conv, [512, 3, 2]]  # 28
  - [[-1, 11], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C3k2, [1024, True]] # 30 (P5/32-level)

  - [[21, 24, 27, 30], 1, Detect, [nc]] # 4个检测头