# YOLO11n with P2 small object detection head & EMA Attention
nc: 17  # InsPLAD 的 17 类
scales:
  n: [0.50, 0.25, 1024] 

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C3k2, [128, False, 0.25]] # 2-P2 
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C3k2, [256, False, 0.25]] # 4-P3
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C3k2, [512, True, 0.5]] # 6-P4
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C3k2, [1024, True, 0.5]] # 8-P5
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10
  - [-1, 1, EMA, []] # 11 <--- 新增的 EMA 注意力层

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 12
  - [[-1, 6], 1, Concat, [1]] # 13 cat backbone P4
  - [-1, 3, C3k2, [512, False]] # 14

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 15
  - [[-1, 4], 1, Concat, [1]] # 16 cat backbone P3
  - [-1, 3, C3k2, [256, False]] # 17 (P3/8-level)

  # --- P2 层 (极小目标) ---
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 18
  - [[-1, 2], 1, Concat, [1]] # 19 cat backbone P2
  - [-1, 3, C3k2, [128, False]] # 20 (P2/4-level 极小目标检测层)
  
  # --- 下采样融合路径 ---
  - [-1, 1, Conv, [128, 3, 2]] # 21
  - [[-1, 17], 1, Concat, [1]] # 22 cat head P3 (由于加了EMA，原来的16变成了17)
  - [-1, 3, C3k2, [256, False]] # 23 (P3/8-level)

  - [-1, 1, Conv, [256, 3, 2]] # 24
  - [[-1, 14], 1, Concat, [1]] # 25 cat head P4 (原13变14)
  - [-1, 3, C3k2, [512, False]] # 26 (P4/16-level)

  - [-1, 1, Conv, [512, 3, 2]] # 27
  - [[-1, 11], 1, Concat, [1]] # 28 cat head P5 (原10变11，即拼接EMA的输出)
  - [-1, 3, C3k2, [1024, True]] # 29 (P5/32-level)

  - [[20, 23, 26, 29], 1, Detect, [nc]] # 30: Detect 4个分支输出


